buzzwang1/pcb/source/main/STM32U585CIT/Mini/MBv28b2/Main04Gfx/main.h
#pragma once


//System
#include "cDepTree.h"
#include "ClockInfo.h"

#ifdef __cplusplus
extern "C" {
#endif


/* Includes ------------------------------------------------------------------*/
#include "TypeDef.h"
#include "stm32u5xx.h"
#include "stm32u5xx_hal.h"
#include "stm32u5xx_ll_icache.h"
#include "stm32u5xx_ll_pwr.h"
#include "stm32u5xx_ll_crs.h"
#include "stm32u5xx_ll_rcc.h"
#include "stm32u5xx_ll_bus.h"
#include "stm32u5xx_ll_system.h"
#include "stm32u5xx_ll_cortex.h"
#include "stm32u5xx_ll_utils.h"


extern void SystemClock_Config();
extern void MainSystemInit(void);
extern void vApplicationGetIdleTaskMemory(StaticTask_t** ppxIdleTaskTCBBuffer,
                                          StackType_t** ppxIdleTaskStackBuffer,
                                          u32* pulIdleTaskStackSize);

extern void NMI_Handler(void);
extern void HardFault_Handler(void);
extern void MemManage_Handler(void);
extern void BusFault_Handler(void);
extern void UsageFault_Handler(void);
extern void DebugMon_Handler(void);


#ifdef __cplusplus
}
#endif
